
public class Test {

	public static void main(String[] args) {
		/*
		 * [응용문제] // 조건문 코드

고객이 자신의 통장에서 입,출금을 하는 프로세서 제작을 해야 함.
고객의 기본 자산금액: 100,000원

"1번 입력 시 입금, 2번 입력 시 출금입니다." 라는 메시지 제일 먼저 실행되어야 함.

1번을 입력 시 "해당 금액을 입력하세요"
사용자가 입력한 금액 + 기본 자산금액을 합한 총 자산금액을 출력하면 됨.

2번을 입력 시 "출금할 금액을 입력하세요"
사용자가 입력한 금액 - 기본 자산금액을 계산하여 총 자산금액을 출력하면 됨.
		 */
		
		
		//For 문 응용문제
		
		//응용문제 20~27까지 출력.
		
		//응용문제 39~21까지 출력.
		
		//1~10까지 출력
		
		/*응용문제 변수 2개를 이용하여 다음 데이터를 출력하시오.
		55~4까지 출력
		*/
		
		/*
		 * 응용문제
		 * 다음 결과 값을 보고 코드를 작성하시오.
		 * [결과값]
		 * 45,40,35,30,25,20,
		 * 
		 * */ 
		
		/*
		 * 응용문제
		 * 다음 결과 값을 보고 코드를 작성하시오.
		 * [결과값]
		 * 11,22,33,44,55,66,77,88,99
		 * 
		 * 
		for(a=1;a<=9;a++) {
			c=a*b;
			System.out.print(c+",");
		}
		*/ 

		// while 응용문제
		
		/*
		 * [응용문제]
		 * 다음 사항을 while문으로 작성하시오.
		 * 22~16까지 숫자를 출력하시오
		 */
		
		/*
		 * [응용문제]
		 * 변수 두 개를 이용하여 범위에 맞게 값을 출력하시오.
		 * 99~47까지 출력
		 */
		
		/*
		 * 응용문제
		 * 해당 결과 값을 확인하여 반복문으로 코드를 작성하시오.
		 * 56, 49, 42, 35, 28, 21,
		 */
		
		/*
		 * 응용문제 2
		 * 해당 결과 값을 확인하여 반복문으로 코드를 작성하시오.
		 * 4, 7, 10, 13, 16, 19, 22,
		 */
		
		//Do~while 응용문제
		
		/*
		 * 응용문제
		 * 5~0까지 출력되는 Do~while문 작성하시오.
		 * */
		
		/*
		 * 응용문제
		 * 다음 결과값을 보고 do~while문으로 코드를 작성하시오.
		 * 35 45 55 65 75
		 *
		 */
		
		/*
		 * Scanner를 통해 for, while, do~while문을 사용하여
		 * 각각 구구단을 만드시오.
		 */
		
		/*
		 * 응용문제
		 * 전체 값은 500이 있습니다. 총 8회 동안 반복되면서
		 * 한 번 반복할 때 마다 12씩 감소하도록 하여 최종 값을 출력하시오
		 * 
		 */
		
		/*
		 * 응용문제
		 * 구구단 2단 2*1 ~ 2*9까지의 총 합계를 출력하시오
		 * 정답 90
		 */
		
		
	}

}
